[{"article_link": "https://dl.acm.org/doi/10.1145/3417516", "title": "Obsidian: Typestate and Assets for Safer Blockchain Programming", "doi": "10.1145/3430314", "issn": "0164-0925", "journal_name": "ACM Transactions on Programming Languages and Systems", "date_publication": "September 2020", "abstract": "Blockchain platforms are coming into use for processing critical transactions among participants who have not established mutual trust. Many blockchains are programmable, supporting smart contracts, which maintain persistent state and support transactions that transform the state. Unfortunately, bugs in many smart contracts have been exploited by hackers. Obsidian is a novel programming language with a type system that enables static detection of bugs that are common in smart contracts today. Obsidian is based on a core calculus, Silica, for which we proved type soundness. Obsidian uses typestate to detect improper state manipulation and uses linear types to detect abuse of assets. We integrated a permissions system that encodes a notion of ownership to allow for safe, flexible aliasing. We describe two case studies that evaluate Obsidian’s applicability to the domains of parametric insurance and supply chain management, finding that Obsidian’s type system facilitates reasoning about high-level states and ownership of resources. We compared our Obsidian implementation to a Solidity implementation, observing that the Solidity implementation requires much boilerplate checking and tracking of state, whereas Obsidian does this work statically.", "authors": [{"Name": "Michael Coblenz", "Information": "Carnegie Mellon University, PA, USA"}, {"Name": "Reed Oei", "Information": "University of Illinois at Urbana-Champaign, Urbana, IL, USA"}, {"Name": "Tyler Etzel", "Information": "Facebook, CA, USA"}, {"Name": "Paulette Koronkevich", "Information": "University of British Columbia, Vancouver, BC, Canada"}, {"Name": "Miles Baker", "Information": "Amazon.com, Inc."}, {"Name": "Yannick Bloem", "Information": "Apple Computer"}, {"Name": "Brad Allan Myers", "Information": "Carnegie Mellon University"}, {"Name": "Joshua Sunshine", "Information": "Carnegie Mellon University"}, {"Name": "Jonathan Aldrich", "Information": "Carnegie Mellon University"}], "publisher": "Association for Computing Machinery", "total_usage": "1,863", "year": "2020"}, {"article_link": "https://dl.acm.org/doi/10.1145/3531016", "title": "BMIF: Privacy-preserving Blockchain-based Medical Image Fusion", "doi": "10.1145/3572859", "issn": "1551-6857", "journal_name": "ACM Transactions on Multimedia Computing, Communications, and Applications", "date_publication": "February 2023", "abstract": "Medical image fusion generates a fused image containing multiple features extracted from different source images, and it is of great help in clinical analysis and diagnosis. However, training a deep learning model for image fusion usually requires enormous computing power, especially for large volumes of medical data. Meanwhile, the privacy of images is also a critical issue. In this article, we propose a privacy-preserving blockchain-based medical image fusion (BMIF) framework. First, to ensure fusion performance, we design a new medical image fusion model based on convolutional neural network and Inception network and integrate the proposed model into the consensus process of blockchain. Next, to save computing power of blockchain, we design a consensus mechanism by requesting consensus nodes to train the fusion model instead of calculating useless hash values in traditional blockchain. Then, to protect data privacy, we further present an efficient homomorphic encryption to realize the training of fusion model on encrypted medical data. Finally, we conduct theoretical analysis and extensive experiments on public datasets to evaluate the feasibility and the performance of our proposed BMIF. The results exhibit that BMIF is efficient and secure, and our medical image fusion network performs better than state-of-the-art approaches.", "authors": [{"Name": "Tao Xiang", "Information": "College of Computer Science, Chongqing University, China"}, {"Name": "Honghong Zeng", "Information": "College of Computer Science, Chongqing University, China"}, {"Name": "Biwen Chen", "Information": "College of Computer Science, Chongqing University, China"}, {"Name": "Shangwei Guo", "Information": "College of Computer Science, Chongqing University, China"}], "publisher": "Association for Computing Machinery", "total_usage": "471", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3603714", "title": "Transactional Services for Concurrent Mobile Agents over Edge/Cloud Computing-Assisted Social Internet of Things", "doi": "10.1145/3611329", "issn": "1936-1955", "journal_name": "Journal of Data and Information Quality", "date_publication": "September 2023", "abstract": "The Web of Things (WoT) is a concept that aims to create a network of intelligent devices capable of remote monitoring, service provisioning, and control. Virtual and Physical Internet of Things (IoT) gateways facilitate communication, processing, and storage among social nodes that form the social Web of Things (SWoT). Peripheral IoT services commonly use device data. However, due to the limited bandwidth and processing power of edge devices in the IoT, they must dynamically alter the quality of service provided to their connected clients to meet each user's needs while also meeting the service quality requirements of other devices that may access the same data. Consequently, deciding which transactions get access to which Internet of Things data is a scheduling problem.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "94", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3408310", "title": "A Novel Memory-hard Password Hashing Scheme for Blockchain-based Cyber-physical Systems", "doi": "10.1145/3453144", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "June 2021", "abstract": "There has been an increasing interest of integrating blockchain into cyber-physical systems (CPS). The design of password hashing schemes (PHSs) is in the core of blockchain security. However, no existing PHS seems to meet both the requirements of sufficient security and small code size for blockchain-based CPSs. In this article, a novel memory-hard PHS based on the classic PBKDF2 is proposed. Evaluation results show that the proposed scheme is promising for blockchain-based CPS, as it manages to provide enhanced security in comparison to PBKDF2 with limited increase in code size.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "223", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3341104", "title": "Efficient and Privacy-preserving Fog-assisted Health Data Sharing Scheme", "doi": "10.1145/3368406", "issn": "2157-6904", "journal_name": "ACM Transactions on Intelligent Systems and Technology", "date_publication": "November 2019", "abstract": "Pervasive data collected from e-healthcare devices possess significant medical value through data sharing with professional healthcare service providers. However, health data sharing poses several security issues, such as access control and privacy leakage, as well as faces critical challenges to obtain efficient data analysis and services. In this article, we propose an efficient and privacy-preserving fog-assisted health data sharing (PFHDS) scheme for e-healthcare systems. Specifically, we integrate the fog node to classify the shared data into different categories according to disease risks for efficient health data analysis. Meanwhile, we design an enhanced attribute-based encryption method through combination of a personal access policy on patients and a professional access policy on the fog node for effective medical service provision. Furthermore, we achieve significant encryption consumption reduction for patients by offloading a portion of the computation and storage burden from patients to the fog node. Security discussions show that PFHDS realizes data confidentiality and fine-grained access control with collusion resistance. Performance evaluations demonstrate cost-efficient encryption computation, storage and energy consumption.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "574", "year": "2019"}, {"article_link": "https://dl.acm.org/doi/10.1145/3417987", "title": "Security and Privacy in IoT Using Machine Learning and Blockchain: Threats and Countermeasures", "doi": "10.1145/3441629", "issn": "0360-0300", "journal_name": "ACM Computing Surveys", "date_publication": "November 2021", "abstract": "Security and privacy of users have become significant concerns due to the involvement of the Internet of Things (IoT) devices in numerous applications. Cyber threats are growing at an explosive pace making the existing security and privacy measures inadequate. Hence, everyone on the Internet is a product for hackers. Consequently, Machine Learning (ML) algorithms are used to produce accurate outputs from large complex databases, where the generated outputs can be used to predict and detect vulnerabilities in IoT-based systems. Furthermore, Blockchain (BC) techniques are becoming popular in modern IoT applications to solve security and privacy issues. Several studies have been conducted on either ML algorithms or BC techniques. However, these studies target either security or privacy issues using ML algorithms or BC techniques, thus posing a need for a combined survey on efforts made in recent years addressing both security and privacy issues using ML algorithms and BC techniques. In this article, we provide a summary of research efforts made in the past few years, from 2008 to 2019, addressing security and privacy issues using ML algorithms and BC techniques in the IoT domain. First, we discuss and categorize various security and privacy threats reported in the past 12 years in the IoT domain. We then classify the literature on security and privacy efforts based on ML algorithms and BC techniques in the IoT domain. Finally, we identify and illuminate several challenges and future research directions using ML algorithms and BC techniques to address security and privacy issues in the IoT domain.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "2,720", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3595179", "title": "HMT: A Hardware-centric Hybrid Bonsai Merkle Tree Algorithm for High-performance Authentication", "doi": "10.1145/3610418", "issn": "1539-9087", "journal_name": "ACM Transactions on Embedded Computing Systems", "date_publication": "July 2023", "abstract": "The Bonsai Merkle tree (BMT) is a widely used tree structure for authentication of metadata such as encryption counters in a secure computing system. Common BMT algorithms were designed for traditional Von Neumann architectures with a software-centric implementation in mind and as such, they are predominantly recursive and sequential in nature. However, the modern heterogeneous computing platforms employing Field-Programmable Gate Array (FPGA) devices require concurrency-focused algorithms to fully utilize the versatility and parallel nature of such systems. The recursive nature of traditional BMT algorithms makes them challenging to implement in such hardware-based setups.", "authors": [{"Name": "Rakin Muhammad Shadab", "Information": "University of Central Florida"}, {"Name": "Yu Zou", "Information": "University of Central Florida"}, {"Name": "Sanjay Gandham", "Information": "University of Central Florida"}, {"Name": "Amro Awad", "Information": "North Carolina State University"}, {"Name": "Mingjie Lin", "Information": "University of Central Florida"}], "publisher": "Association for Computing Machinery", "total_usage": "120", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3199665", "title": "Democratizing Authority in the Built Environment", "doi": "10.1145/3294070", "issn": "1550-4859", "journal_name": "ACM Transactions on Sensor Networks", "date_publication": "November 2018", "abstract": "Operating systems and applications in the built environment have relied upon central authorization and management mechanisms that restrict their scalability, especially with respect to administrative overhead. We propose a new set of primitives encompassing syndication, security, and service execution that unifies the management of applications and services across the built environment, while enabling participants to individually delegate privilege across multiple administrative domains with no loss of security or manageability. We show how to leverage a decentralized authorization syndication platform to extend the design of building operating systems beyond the single administrative domain of a building. The authorization system leveraged is based on blockchain smart contracts to permit decentralized and democratized delegation of authorization without central trust. Upon this, a publish/subscribe syndication tier and a containerized service execution environment are constructed. Combined, these mechanisms solve problems of delegation, federation, device protection and service execution that arise throughout the built environment. We leverage a high-fidelity city-scale emulation to verify the scalability of the authorization tier, and briefly describe a prototypical democratized operating system for the built environment using this foundation.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "734", "year": "2018"}, {"article_link": "https://dl.acm.org/doi/10.1145/3315571", "title": "Electronics Supply Chain Integrity Enabled by Blockchain", "doi": "10.1145/3319359", "issn": "1084-4309", "journal_name": "ACM Transactions on Design Automation of Electronic Systems", "date_publication": "May 2019", "abstract": "Electronic systems are ubiquitous today, playing an irreplaceable role in our personal lives, as well as in critical infrastructures such as power grids, satellite communications, and public transportation. In the past few decades, the security of software running on these systems has received significant attention. However, hardware has been assumed to be trustworthy and reliable “by default” without really analyzing the vulnerabilities in the electronics supply chain. With the rapid globalization of the semiconductor industry, it has become challenging to ensure the integrity and security of hardware. In this article, we discuss the integrity concerns associated with a globalized electronics supply chain. More specifically, we divide the supply chain into six distinct entities: IP owner/foundry (OCM), distributor, assembler, integrator, end user, and electronics recycler, and analyze the vulnerabilities and threats associated with each stage. To address the concerns of the supply chain integrity, we propose a blockchain-based certificate authority framework that can be used to manage critical chip information such as electronic chip identification, chip grade, and transaction time. The decentralized nature of the proposed framework can mitigate most threats of the electronics supply chain, such as recycling, remarking, cloning, and overproduction.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "1,734", "year": "2019"}, {"article_link": "https://dl.acm.org/doi/10.1145/3511904", "title": "Privacy-Aware Traffic Flow Prediction Based on Multi-Party Sensor Data with Zero Trust in Smart City", "doi": "10.1145/3615983", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "August 2023", "abstract": "With the continuous increment of city volume and size, a number of traffic-related urban units (e.g., vehicles, roads, buildings, etc.) are emerging rapidly, which plays a heavy burden on the scientific traffic control of smart cities. In this situation, it is becoming a necessity to utilize the sensor data from massive cameras deployed at city crossings for accurate traffic flow prediction. However, the traffic sensor data are often distributed and stored by different organizations or parties with zero trust, which impedes the multi-party sensor data sharing significantly due to privacy concerns. Therefore, it requires challenging efforts to balance the trade-off between data sharing and data privacy to enable cross-organization traffic data fusion and prediction. In light of this challenge, we put forward an accurate LSH (locality-sensitive hashing)-based traffic flow prediction approach with the ability to protect privacy. Finally, through a series of experiments deployed on a real-world traffic dataset, we demonstrate the feasibility of our proposal in terms of prediction accuracy and efficiency while guaranteeing sensor data privacy.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "867", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3448649", "title": "Automated Security Assessment Framework for Wearable BLE-enabled Health Monitoring Devices", "doi": "10.1145/3483347", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "February 2022", "abstract": "The growth of IoT technology, increasing prevalence of embedded devices, and advancements in biomedical technology have led to the emergence of numerous wearable health monitoring devices (WHMDs) in clinical settings and in the community. The majority of these devices are Bluetooth Low Energy (BLE) enabled. Though the advantages offered by BLE-enabled WHMDs in tracking, diagnosing, and intervening with patients are substantial, the risk of cyberattacks on these devices is likely to increase with device complexity and new communication protocols. Furthermore, vendors face risk and financial tradeoffs between speed to market and ensuring device security in all situations. Previous research has explored the security and privacy of such devices by manually testing popular BLE-enabled WHMDs in the market and generally discussed categories of possible attacks, while mostly focused on IP devices. In this work, we propose a new semi-automated framework that can be used to identify and discover both known and unknown vulnerabilities in WHMDs. To demonstrate its implementation, we validate it with a number of commercially available BLE-enabled enabled wearable devices. Our results show that the devices are vulnerable to a number of attacks, including eavesdropping, data manipulation, and denial of service attacks. The proposed framework could therefore be used to evaluate potential devices before adoption into a secure network or, ideally, during the design and implementation of new devices.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "282", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3511903", "title": "Securing Low-Power Blockchain-enabled IoT Devices against Energy Depletion Attack", "doi": "10.1145/3615983", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "August 2023", "abstract": "Blockchain-enabled Internet of Things (IoT) envisions a world with rapid development and implementations to change our everyday lives based on smart devices. These devices are attached to the internet that can communicate with each other without human interference. A well-known wireless network in blockchain-enabled IoT frameworks is the Low Power and Lossy Network (LLN) that uses a novel protocol known as Routing protocol for low power and lossy networks (RPL) to provide effective and energy-efficient routing. LLNs that run on RPL are inherently prone to multiple Denial of Service (DoS) attacks due to the low cost, shared medium, and resource-constrained nature of blockchain-enabled IoT devices. A Spam DODAG Information Solicitation (DIS) attack is one of the novel attacks that drains the energy source of legitimate nodes and ends up causing the legitimate nodes to suffer from DoS. To address this problem, a mitigation scheme named DIS Spam Attack Mitigation (DISAM) is proposed. The proposed scheme effectively mitigates the effects of the Spam DIS attack on the network’s performance. The experimental results show that DISAM detects and mitigates the attack quickly and efficiently.", "authors": [{"Name": "Amjad Alsirhani", "Information": "Jouf University, Sakaka Aljouf, Kingdom of Saudi Arabia and Faculty of Computer Science, Dalhousie University, Canada"}, {"Name": "Muhammadali Khan", "Information": "COMSATS University Islamabad, Lahore Campus, Pakistan"}, {"Name": "Abdullah Alomari", "Information": "Albaha University, Kingdom of Saudi Arabia"}, {"Name": "Sauda Maryam", "Information": "COMSATS University Islamabad, Lahore Campus, Pakistan"}, {"Name": "Aiman Younas", "Information": "COMSATS University Islamabad"}, {"Name": "Muddesar Iqbal", "Information": "London South Bank University"}, {"Name": "Muhammad Hameed Siqqidi", "Information": "Jouf University"}, {"Name": "Amjad Ali", "Information": "Hamad Bin Khalifa University, College of Science and Engineering"}], "publisher": "Association for Computing Machinery", "total_usage": "373", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3483332", "title": "Analysis of Trending Topics and Text-based Channels of Information Delivery in Cybersecurity", "doi": "10.1145/3490674", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "May 2022", "abstract": "Computer users are generally faced with difficulties in making correct security decisions. While an increasingly fewer number of people are trying or willing to take formal security training, online sources including news, security blogs, and websites are continuously making security knowledge more accessible. Analysis of cybersecurity texts from this grey literature can provide insights into the trending topics and identify current security issues as well as how cyber attacks evolve over time. These in turn can support researchers and practitioners in predicting and preparing for these attacks. Comparing different sources may facilitate the learning process for normal users by creating the patterns of the security knowledge gained from different sources. Prior studies neither systematically analysed the wide range of digital sources nor provided any standardisation in analysing the trending topics from recent security texts. Moreover, existing topic modelling methods are not capable of identifying the cybersecurity concepts completely and the generated topics considerably overlap. To address this issue, we propose a semi-automated classification method to generate comprehensive security categories to analyse trending topics. We further compare the identified 16 security categories across different sources based on their popularity and impact. We have revealed several surprising findings as follows: (1) The impact reflected from cybersecurity texts strongly correlates with the monetary loss caused by cybercrimes, (2) security blogs have produced the context of cybersecurity most intensively, and (3) websites deliver security information without caring about timeliness much.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "508", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3522582", "title": "A Survey of Practical Formal Methods for Security", "doi": "10.1145/3543541", "issn": "0934-5043", "journal_name": "Formal Aspects of Computing", "date_publication": "March 2022", "abstract": "In today’s world, critical infrastructure is often controlled by computing systems. This introduces new risks for cyber attacks, which can compromise the security and disrupt the functionality of these systems. It is therefore necessary to build such systems with strong guarantees of resiliency against cyber attacks. One way to achieve this level of assurance is using formal verification, which provides proofs of system compliance with desired cyber security properties. The use of Formal Methods (FM) in aspects of cyber security and safety-critical systems are reviewed in this article. We split FM into the three main classes: theorem proving, model checking, and lightweight FM. To allow the different uses of FM to be compared, we define a common set of terms. We further develop categories based on the type of computing system FM are applied in. Solutions in each class and category are presented, discussed, compared, and summarised. We describe historical highlights and developments and present a state-of-the-art review in the area of FM in cyber security. This review is presented from the point of view of FM practitioners and researchers, commenting on the trends in each of the classes and categories. This is achieved by considering all types of FM, several types of security and safety-critical systems, and by structuring the taxonomy accordingly. The article hence provides a comprehensive overview of FM and techniques available to system designers of security-critical systems, simplifying the process of choosing the right tool for the task. The article concludes by summarising the discussion of the review, focusing on best practices, challenges, general future trends, and directions of research within this field.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "4,502", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3397202", "title": "Blockchain-based Data Sharing System for Sensing-as-a-Service in Smart Cities", "doi": "10.1145/3453144", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "June 2021", "abstract": "The sensing-as-a-service (SaaS) model has been explored to address the challenge of intractability of managing a large number of sensors faced by future smart cities. However, how to effectively share sensor data without compromising confidentiality, privacy protection, and fair trading without third parties is one of critical issues that must be solved in the SaaS in smart cities. While blockchain shows promise in solving these issues, the existing blockchain-based data sharing (BBDS) systems are difficult to apply to SaaS in smart cities because of many unresolved issues such as requiring a customized blockchain, huge storage, communication and computation costs, and dependence on a third party to achieve fair trading. We propose a BBDS system model with its security requirements before we present a concrete construction by combining\n-protocol, Paillier encryption scheme, and any secure symmetrical encryption and signature schemes. To demonstrate the utility of our proposed BBDS system, we present a security analysis and compare our system with other solutions. We implement the prototype in Remix to analyze the gas cost, and we conduct experiments to evaluate the communication and computation costs of the BBDS system using symmetric encryption (advanced encryption standard (AES)) and a signature scheme (elliptic curve digital signature algorithm (ECDSA)).", "authors": [{"Name": "Chao Lin", "Information": "School of Cyber Science and Engineering, Wuhan University, China and Cyberspace Security Research Center, Peng Cheng Laboratory, China"}, {"Name": "Debiao He", "Information": "School of Cyber Science and Engineering, Wuhan University, China and Cyberspace Security Research Center, Peng Cheng Laboratory, China"}, {"Name": "Sherali Zeadally", "Information": "College of Communication and Information, University of Kentucky, USA"}, {"Name": "Xinyi Huang", "Information": "College of Mathematics and Informatics, Fujian Normal University, China and Fujian Provincial Key Laboratory of Network Security and Cryptology, China"}, {"Name": "Zhe Liu", "Information": "College of Computer Science and Technology, Nanjing University of Aeronautics and Astronautics, China"}], "publisher": "Association for Computing Machinery", "total_usage": "407", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3432250", "title": "PROLISEAN: A New Security Protocol for Programmable Matter", "doi": "10.1145/3441681", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "February 2021", "abstract": "The vision for programmable matter is to create a material that can be reprogrammed to have different shapes and to change its physical properties on demand. They are autonomous systems composed of a huge number of independent connected elements called particles. The connections to one another form the overall shape of the system. These particles are capable of interacting with each other and take decisions based on their environment. Beyond sensing, processing, and communication capabilities, programmable matter includes actuation and motion capabilities. It could be deployed in different domains and will constitute an intelligent component of the IoT. A lot of applications can derive from this technology, such as medical or industrial applications. However, just like any other technology, security is a huge concern. Given its distributed architecture and its processing limitations, programmable matter cannot handle the traditional security protocols and encryption algorithms. This article proposes a new security protocol optimized and dedicated for IoT programmable matter. This protocol is based on lightweight cryptography and uses the same encryption protocol as a hashing function while keeping the distributed architecture in mind. The analysis and simulation results show the efficiency of the proposed method and that a supercomputer will need about 5.93 × 1025 years to decrypt the message.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "88", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3529097", "title": "An Architecture Using Payment Channel Networks for Blockchain-based Wi-Fi Sharing", "doi": "10.1145/3580447", "issn": "2158-656X", "journal_name": "ACM Transactions on Management Information Systems", "date_publication": "March 2023", "abstract": "Enabling Internet access while taking load of mobile networks, the concept of Wi-Fi sharing holds much potential. While trust-based concepts require a trusted intermediary and cannot prevent malicious behavior, for example, conducted through fake profiles, security-based approaches lack adequate accounting mechanisms and coverage. Against this backdrop, we develop a Wi-Fi sharing architecture based on blockchain technology and payment channel networks. Our contribution is twofold: First, we present a comprehensive collection of design principles for workable Wi-Fi sharing networks. Second, we propose and evaluate a reference architecture that augments current approaches with adequate accounting mechanisms and facilitates performance, scalability, security, and participant satisfaction.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "940", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3404890", "title": "Blockchain-enabled Tensor-based Conditional Deep Convolutional GAN for Cyber-physical-Social Systems", "doi": "10.1145/3453144", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "June 2021", "abstract": "Deep learning techniques have shown significant success in cyber-physical-social systems (CPSS). As an instance of deep learning models, generative adversarial nets (GAN) model enables powerful and flexible image augmentation, image generation, and classification, thus can be applied to real-world CPSS settings. GAN model training needs a large collection of cyber-physical-social data originating from various CPSS devices. Numerous prevailing GAN models depend on a tacit assumption that several cyber-physical-social data providers present a reliable source to collect training data, which is seldom the case in real CPSS. The existing GAN models also fail to consider multi-dimensional latent structure. In our work, we put forward a novel blockchain-enabled tensor-based conditional deep convolutional GAN (TCDC-GAN) model for cyber-physical-social systems. The blockchain is employed to develop a decentralized and reliable cyber-physical-social data-sharing platform between numerous cyber-physical-social data providers, such that the training data and the model are documented on a ledger that is distributed. Furthermore, a tensor-based generator and a tensor-based discriminator are well designed by employing the tensor model. The results of extensive simulation experiments show the efficacy of the proposed TCDC-GAN model. Compared with the state-of-the-art models, our model gains superior estimation performance.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "235", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3453186", "title": "MEC-Based Jamming-Aided Anti-Eavesdropping with Deep Reinforcement Learning for WBANs", "doi": "10.1145/3498359", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "August 2022", "abstract": "Wireless body area network (WBAN) suffers secure challenges, especially the eavesdropping attack, due to constraint resources. In this article, deep reinforcement learning (DRL) and mobile edge computing (MEC) technology are adopted to formulate a DRL-MEC-based jamming-aided anti-eavesdropping (DMEC-JAE) scheme to resist the eavesdropping attack without considering the channel state information. In this scheme, a MEC sensor is chosen to send artificial jamming signals to improve the secrecy rate of the system. Power control technique is utilized to optimize the transmission power of both the source sensor and the MEC sensor to save energy. The remaining energy of the MEC sensor is concerned to ensure routine data transmission and jamming signal transmission. Additionally, the DMEC-JAE scheme integrates with transfer learning for a higher learning rate. The performance bounds of the scheme concerning the secrecy rate, energy consumption, and the utility are evaluated. Simulation results show that the DMEC-JAE scheme can approach the performance bounds with high learning speed, which outperforms the benchmark schemes.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "538", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3445788", "title": "Blockchain in eCommerce: A Special Issue of the ACM Transactions on Internet of ThingsBlockchain in eCommerce: A Special Issue of the ACM Transactions on Internet of Things", "doi": "10.1145/3441681", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "February 2021", "abstract": "As blockchain technology is becoming a driving force in the global economy, it is also gaining critical acclaim in the e-commerce industry. Both the blockchain and e-commerce are inseparable as they involve transactions. Blockchain protect transactions and e-commerce activities rely on them. Blockchain technology enables a decentralized marketplace to support important business activities like secure payments, managing the supply chain and reducing the fraud to mention few. In this special issue editorial we are introducing 11 research articles in this hot area of research that were selected by our reviewers from over than 250 submissions.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "756", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3506800", "title": "Super-optimization of Smart Contracts", "doi": "10.1145/3543992", "issn": "1049-331X", "journal_name": "ACM Transactions on Software Engineering and Methodology", "date_publication": "October 2022", "abstract": "Smart contracts are programs deployed on a blockchain. They are executed for a monetary fee paid in gas—a clear optimization target for smart contract compilers. Because smart contracts are a young, fast-moving field without (manually) fine-tuned compilers, they highly benefit from automated and adaptable approaches, especially as smart contracts are effectively immutable, and as such need a high level of assurance. This makes them an ideal domain for applying formal methods. Super-optimization is a technique to find the best translation of a block of instructions by trying all possible sequences of instructions that produce the same result. We present a framework for super-optimizing smart contracts based on Max-SMT with two main ingredients: (1) a stack functional specification extracted from the basic blocks of a smart contract, which is simplified using rules capturing the semantics of arithmetic, bit-wise, and relational operations, and (2) the synthesis of optimized blocks, which finds—by means of an efficient SMT encoding—basic blocks with minimal gas cost whose stack functional specification is equal (modulo commutativity) to the extracted one.", "authors": [{"Name": "Elvira Albert", "Information": "Complutense University of Madrid, Spain"}, {"Name": "Pablo Gordillo", "Information": "Complutense University of Madrid, Spain"}, {"Name": "Alejandro Hernández-Cerezo", "Information": "Complutense University of Madrid, Spain"}, {"Name": "Albert Rubio", "Information": "Complutense University of Madrid, Spain"}, {"Name": "Maria A Schett", "Information": "University College London, UK"}], "publisher": "Association for Computing Machinery", "total_usage": "742", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3539662", "title": "Edge Computing for Cyber-physical Systems: A Systematic Mapping Study Emphasizing Trustworthiness", "doi": "10.1145/3551653", "issn": "2378-962X", "journal_name": "ACM Transactions on Cyber-Physical Systems", "date_publication": "July 2022", "abstract": "Edge computing is projected to have profound implications in the coming decades, proposed to provide solutions for applications such as augmented reality, predictive functionalities, and collaborative Cyber-Physical Systems (CPS). For such applications, edge computing addresses the new computational needs, as well as privacy, availability, and real-time constraints, by providing local high-performance computing capabilities to deal with the limitations and constraints of cloud and embedded systems. Edge computing is today driven by strong market forces stemming from IT/cloud, telecom, and networking—with corresponding multiple interpretations of “edge computing” (e.g., device edge, network edge, distributed cloud). Considering the strong drivers for edge computing and the relative novelty of the field, it becomes important to understand the specific requirements and characteristics of edge-based CPS, and to ensure that research is guided adequately, e.g., avoiding specific gaps.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "1,474", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3453169", "title": "Towards Communication-Efficient and Attack-Resistant Federated Edge Learning for Industrial Internet of Things", "doi": "10.1145/3498359", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "August 2022", "abstract": "Federated Edge Learning (FEL) allows edge nodes to train a global deep learning model collaboratively for edge computing in the Industrial Internet of Things (IIoT), which significantly promotes the development of Industrial 4.0. However, FEL faces two critical challenges: communication overhead and data privacy. FEL suffers from expensive communication overhead when training large-scale multi-node models. Furthermore, due to the vulnerability of FEL to gradient leakage and label-flipping attacks, the training process of the global model is easily compromised by adversaries. To address these challenges, we propose a communication-efficient and privacy-enhanced asynchronous FEL framework for edge computing in IIoT. First, we introduce an asynchronous model update scheme to reduce the computation time that edge nodes wait for global model aggregation. Second, we propose an asynchronous local differential privacy mechanism, which improves communication efficiency and mitigates gradient leakage attacks by adding well-designed noise to the gradients of edge nodes. Third, we design a cloud-side malicious node detection mechanism to detect malicious nodes by testing the local model quality. Such a mechanism can avoid malicious nodes participating in training to mitigate label-flipping attacks. Extensive experimental studies on two real-world datasets demonstrate that the proposed framework can not only improve communication efficiency but also mitigate malicious attacks while its accuracy is comparable to traditional FEL frameworks.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "866", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3501810", "title": "PSDF: Privacy-aware IoV Service Deployment with Federated Learning in Cloud-Edge Computing", "doi": "10.1145/3542930", "issn": "2157-6904", "journal_name": "ACM Transactions on Intelligent Systems and Technology", "date_publication": "October 2022", "abstract": "Through the collaboration of cloud and edge, cloud-edge computing allows the edge that approximates end-users undertakes those non-computationally intensive service processing of the cloud, reducing the communication overhead and satisfying the low latency requirement of Internet of Vehicle (IoV). With cloud-edge computing, the computing tasks in IoV is able to be delivered to the edge servers (ESs) instead of the cloud and rely on the deployed services of ESs for a series of processing. Due to the storage and computing resource limits of ESs, how to dynamically deploy partial services to the edge is still a puzzle. Moreover, the decision of service deployment often requires the transmission of local service requests from ESs to the cloud, which increases the risk of privacy leakage. In this article, a method for privacy-aware IoV service deployment with federated learning in cloud-edge computing, named PSDF, is proposed. Technically, federated learning secures the distributed training of deployment decision network on each ES by the exchange and aggregation of model weights, avoiding the original data transmission. Meanwhile, homomorphic encryption is adopted for the uploaded weights before the model aggregation on the cloud. Besides, a service deployment scheme based on deep deterministic policy gradient is proposed. Eventually, the performance of PSDF is evaluated by massive experiments.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "521", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3415151", "title": "Fog-based Secure Service Discovery for Internet of Multimedia Things: A Cross-blockchain Approach", "doi": "10.1145/3444536", "issn": "1551-6857", "journal_name": "ACM Transactions on Multimedia Computing, Communications, and Applications", "date_publication": "October 2020", "abstract": "The Internet of Multimedia Things (IoMT) has become the backbone of innumerable multimedia applications in various fields. The wide application of IoMT not only makes our life convenient but also brings challenges to service discovery. Service discovery aims to leverage location information and trust evidence scattered in a variety of multimedia applications to find trusted IoMT devices that can provide specific service in target areas. However, the eavesdropping and tampering to these sensitive IoMT data during the trust propagation process invalidate the service discovery process. To address these challenges, we propose Secure Service Discovery (SSD) for IoMT using cross-blockchain-enabled fog computing. To resist the tampering and eavesdropping during the trust propagation process, a scalable cross-blockchain structure consisting of multiple parallel blockchains is first proposed based on fog, in which different parallel blockchains can be orchestrated to propagate encrypted location information and trust evidence of different applications. Moreover, to enable a cross-blockchain structure to leverage encrypted location information and trust evidence to find trusted IoMT devices in preset areas, a novel privacy-preserving range query is proposed to query and aggregate trust evidence. Security analysis and simulations are carried out to demonstrate the effectiveness and security of the proposed SSD.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "347", "year": "2020"}, {"article_link": "https://dl.acm.org/doi/10.1145/2732196", "title": "Misbehavior in Bitcoin: A Study of Double-Spending and Accountability", "doi": "10.1145/2786062", "issn": "1094-9224", "journal_name": "ACM Transactions on Information and System Security", "date_publication": "June 2015", "abstract": "Bitcoin is a decentralized payment system that relies on Proof-of-Work (PoW) to resist double-spending through a distributed timestamping service. To ensure the operation and security of Bitcoin, it is essential that all transactions and their order of execution are available to all Bitcoin users.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "2,483", "year": "2015"}, {"article_link": "https://dl.acm.org/doi/10.1145/3597206", "title": "Semantic-Enriched Code Knowledge Graph to Reveal Unknowns in Smart Contract Code Reuse", "doi": "10.1145/3625557", "issn": "1049-331X", "journal_name": "ACM Transactions on Software Engineering and Methodology", "date_publication": "November 2023", "abstract": "Programmers who work with smart contract development often encounter challenges in reusing code from repositories. This is due to the presence of two unknowns that can lead to non-functional and functional failures. These unknowns are implicit collaborations between functions and subtle differences among similar functions. Current code mining methods can extract syntax and semantic knowledge (known knowledge), but they cannot uncover these unknowns due to a significant gap between the known and the unknown. To address this issue, we formulate knowledge acquisition as a knowledge deduction task and propose an analytic flow that uses the function clone as a bridge to gradually deduce the known knowledge into the problem-solving knowledge that can reveal the unknowns. This flow comprises five methods: clone detection, co-occurrence probability calculation, function usage frequency accumulation, description propagation, and control flow graph annotation. This provides a systematic and coherent approach to knowledge deduction. We then structure all of the knowledge into a semantic-enriched code Knowledge Graph (KG) and integrate this KG into two software engineering tasks: code recommendation and crowd-scaled coding practice checking. As a proof of concept, we apply our approach to 5,140 smart contract files available on Etherscan.io and confirm high accuracy of our KG construction steps. In our experiments, our code KG effectively improved code recommendation accuracy by 6% to 45%, increased diversity by 61% to 102%, and enhanced NDCG by 1% to 21%. Furthermore, compared to traditional analysis tools and the debugging-with-the-crowd method, our KG improved time efficiency by 30 to 380 seconds, vulnerability determination accuracy by 20% to 33%, and vulnerability fixing accuracy by 24% to 40% for novice developers who identified and fixed vulnerable smart contract functions.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "237", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3423554", "title": "Multilateral Personal Portfolio Authentication System Based on Hyperledger Fabric", "doi": "10.1145/3441681", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "February 2021", "abstract": "Korean education-related evaluation agencies utilize a centralized system that directly manages learner data. This leaves the intellectual property of the organizations and the personal information of the students vulnerable to leakage should the central server be attacked. In this study, the researchers propose a multilateral personal portfolio authentication system that guarantees the reliability, integrity, and transparency of the data such as learner's schooling history. The system uses the features of blockchain in a distributed network wherein a learner submits schooling data to a peer in the network. The data is then verified through an agreement among the peers and recorded in a chronologically encrypted ledger. The proposed system is implemented based on Hyperledger Fabric and the analysis thereof conducted by evaluating its processing speed, capacity, and security. The analysis indicates that the system is able to successfully intercept the transactions of unvalidated users, thereby preventing the recording of incorrect data by an unauthorized user. Furthermore, it provides a record of previously made changes to a learner's profile, thus improving the integrity and reliability of the data. This system provides a platform to share learner information safely and promptly among schools, certification authorities, and higher learning institutions.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "372", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3491202", "title": "Token-Based Authorization and Authentication for Secure Internet of Vehicles Communication", "doi": "10.1145/3561988", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "November 2022", "abstract": "The Internet of Vehicles (IoV) communication platform provides seamless information exchange facilities in a dynamic mobile city environment. Heterogeneous communication is a common medium for information exchange through autonomous resources distributed and accessed using infrastructure units. Cyber-security is a primary concern in accessing autonomous information from the distributed resources due to anonymity and different types of targeted adversaries. This article proposes token-based authorization and authentication (TAA) for securing IoV communications. The proposed method relies on blockchain technology and random forest learning for authorization and key management for authentication, respectively. In this process, frequent change in tokens and key update features are restricted in a view to maximize the seamlessness in information exchange. Authentication is preceded by knowledge of the data classification without errors to prevent additional overhead. Blockchain-based authorization helps to update specific fields of the tokens to retain the communication ratio by reducing vehicle-to-vehicle losses. The performance of the proposed method is assessed using appropriate simulations for these metrics by varying vehicle density, error rate, and classification sets.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "421", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3355283", "title": "Data Sets, Modeling, and Decision Making in Smart Cities: A Survey", "doi": "10.1145/3372402", "issn": "2378-962X", "journal_name": "ACM Transactions on Cyber-Physical Systems", "date_publication": "April 2020", "abstract": "Cities are deploying tens of thousands of sensors and actuators and developing a large array of smart services. The smart services use sophisticated models and decision-making policies supported by Cyber Physical Systems and Internet of Things technologies. The increasing number of sensors collects a large amount of city data across multiple domains. The collected data have great potential value, but has not yet been fully exploited. This survey focuses on the domains of transportation, environment, emergency and public safety, energy, and social sensing. This article carefully reviews both the data sets being collected across 14 smart cities and the state-of-the-art work in modeling and decision making methodologies. The article also points out the characteristics, challenges faced today, and those challenges that will be exacerbated in the future. Key data issues addressed include heterogeneity, interdisciplinary, integrity, completeness, real-timeliness, and interdependencies. Key decision making issues include safety and service conflicts, security, uncertainty, humans in the loop, and privacy.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "4,137", "year": "2020"}, {"article_link": "https://dl.acm.org/doi/10.1145/3511902", "title": "S-BDS: An Effective Blockchain-based Data Storage Scheme in Zero-Trust IoT", "doi": "10.1145/3615983", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "August 2023", "abstract": "With the development of the Internet of Things (IoT), a large-scale, heterogeneous, and dynamic distributed network has been formed among IoT devices. There is an extreme need to establish a trust mechanism between devices, and blockchain can provide a zero-trust security framework for IoT. However, the efficiency of the blockchain is far from meeting the application requirements of the IoT, which has become the biggest resistance to the application of the blockchain in the IoT. Therefore, this paper combines sharding to build an effective Blockchain-based IoT data storage scheme (S-BDS). Sharding can solve the problem of blockchain capacity and scalability. While the blockchain provides data immutability and traceability for the IoT, it also brings huge demands for data credibility verification. The communication delay in the IoT system seriously affects the security of the system, while the Merkle proof of traditional blockchain occupies a lot of communication resources. This paper constructs Insertable Vector Commitment (IVC) in the bilinear group and replaces the Merkle tree with IVC to store IoT data in the blockchain. The construct has small-sized proof. It also has the ability to record the number of updates, which can prevent replay-attacks. Experiments show that each block processes 1,000 transactions, the proof size of a single data piece is 30% of the original scheme, and proofs from different shards can be aggregated. IVC can effectively reduce communication congestion and improve the stability and security of the IoT system.", "authors": [{"Name": "Jin Wang", "Information": "School of Computer Science and Mathematics, Fujian University of Technology; School of Computer & Communication Engineering, Changsha University of Science & Technology, China"}, {"Name": "Jiahao Chen", "Information": "School of Computer Science and Mathematics, Fujian University of Technology, China"}, {"Name": "Neal Xiong", "Information": "Department of Computer Science and Mathematics, Sul Ross State University, USA"}, {"Name": "Osama Alfarraj", "Information": "Computer Science Department, Community College, King Saud University, Saudi Arabia"}, {"Name": "Amr Tolba", "Information": ""}, {"Name": "Yongjun Ren", "Information": "School of Computer and Software, Nanjing University of Information Science & Technology, China"}], "publisher": "Association for Computing Machinery", "total_usage": "971", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3503462", "title": "Blockchain and Beyond: Understanding Blockchains Through Prototypes and Public Engagement", "doi": "10.1145/3561950", "issn": "1073-0516", "journal_name": "ACM Transactions on Computer-Human Interaction", "date_publication": "October 2022", "abstract": "This article presents an annotated portfolio of projects that seek to understand and communicate the social and societal implications of blockchains, DLTs and smart contracts. These complex technologies rely on human and technical factors to deliver cryptocurrencies, shared computation and trustless protocols but have a secondary benefit in providing a moment to re-think many aspects of society, and imagine alternative possibilities. The projects use design and HCI methods to relate blockchains to a range of topics, including global supply chains, delivery infrastructure, smart grids, volunteering and charitable giving, through engaging public, exploring ideas and speculating on possible futures. Based on an extensive annotated portfolio we draw out learning for the design of blockchain systems, broadening participation and surfacing questions around imaginaries, social implications and engagement with new technology. This paints a comprehensive picture of how HCI and design can shape understandings of the future of complex technologies.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "850", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3558519", "title": "COVID-19: Secure Healthcare Internet of Things Networks, Current Trends and Challenges with Future Research Directions", "doi": "10.1145/3584865", "issn": "1550-4859", "journal_name": "ACM Transactions on Sensor Networks", "date_publication": "August 2023", "abstract": "The number of affirmed COVID-19 cases showed an enormous increase in the recent past throughout the globe. Keeping in view the catastrophic destruction of this devastating virus, there is a must-need situation to maximize the use of existing healthcare technologies such as the healthcare Internet of Things (H-IoT). In healthcare, patient wearable devices are widely recognized as a dormant technology with enormous capabilities to assess and combat various diseases, e.g., cough, seizure, temperature, heartbeat, and so on. As we know, in the H-IoT, patient-wearable devices are dispersed in an infrastructure-free environment that exposes them to several private and public coercion while accumulating and transmitting high sensitive data over the wireless communication channel. Therefore, security is the main concern of these applications, and thus, the primary focus of this article to outline the limitations and challenges in the present literature from 2019 to 2021, to identify the requirements of H-IoT applications used in the context of COVID-19. Following this, we will move one step ahead to explore the current security techniques adopted in these applications. Consequently, we will identify the network architectural, cryptographic, protocols, and operational security challenges during our study to recommend viable research directions and opportunities, which could be helpful and capable to minimize the network architecture, deployment, and maintenance cost with more productive outcomes.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "327", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3421508", "title": "Multi-Tier Stack of Block Chain with Proxy Re-Encryption Method Scheme on the Internet of Things Platform", "doi": "10.1145/3490674", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "May 2022", "abstract": "Block chain provides an innovative solution to information storage, transaction execution, security, and trust building in an open environment. The block chain is technological progress for cyber security and cryptography, with efficiency-related cases varying in smart grids, smart contracts, over the IoT, etc. The movement to exchange data on a server has massively increased with the introduction of the Internet of Things. Hence, in this research, Splitting of proxy re-encryption method (Split-PRE) has been suggested based on the IoT to improve security and privacy in a private block chain. This study proposes a block chain-based proxy re-encryption program to resolve both the trust and scalability problems and to simplify the transactions. After encryption, the system saves the Internet of Things data in a distributed cloud. The framework offers dynamic, smart contracts between the sensor and the device user without the intervention of a trustworthy third party to exchange the captured IoT data. It uses an efficient proxy re-encryption system, which provides the owner and the person existing in the smart contract to see the data. The experimental outcomes show that the proposed approach enhances the efficiency, security, privacy, and feasibility of the system when compared to other existing methods.", "authors": [{"Name": "Bharat S Rawal", "Information": "Cyber Department, Gannon University, Erie, PA, USA"}, {"Name": "Poongodi M", "Information": "Hamad Bin Khalifa University, College of Science and Engineering, Doha, Qatar"}, {"Name": "Gunasekaran Manogaran", "Information": "Computer and Information Science Department, Gannon University, Erie, PA, USA and College of Information and Electrical Engineering, Asia University, Taiwan"}, {"Name": "Mounir Hamdi", "Information": "Hamad Bin Khalifa University, College of Science and Engineering, Doha, Qatar"}], "publisher": "Association for Computing Machinery", "total_usage": "585", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3511900", "title": "V-Gas: Generating High Gas Consumption Inputs to Avoid Out-of-Gas Vulnerability", "doi": "10.1145/3615983", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "August 2023", "abstract": "Out-of-gas errors occur when smart contract programs are provided with inputs that cause excessive gas consumption and which will be easily exploited to perform Denial-of-Service attacks. Various approaches have been proposed to estimate the gas limit of a function in smart contracts to avoid such error. However, underestimation often occurs when the contract is complex In this work, we propose V-Gas, which automatically generates inputs that maximize the gas cost and reduce underestimation. V-Gas is designed based on static analysis and feedback-directed mutational fuzz testing. First, V-Gas builds the gas weighted control flow graph of functions in smart contracts. Then, V-Gas develops gas consumption guided selection and mutation strategies to generate the input that maximize the gas consumption.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "317", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3447032", "title": "Edge Content Caching with Deep Spatiotemporal Residual Network for IoV in Smart City", "doi": "10.1145/3470624", "issn": "1550-4859", "journal_name": "ACM Transactions on Sensor Networks", "date_publication": "August 2021", "abstract": "Internet of Vehicles (IoV) enables numerous in-vehicle applications for smart cities, driving increasing service demands for processing various contents (e.g., videos). Generally, for efficient service delivery, the contents from the service providers are processed on the edge servers (ESs), as edge computing offers vehicular applications low-latency services. However, due to the reusability of the same contents required by different distributed vehicular users, processing the copies of the same contents repeatedly in an edge server leads to a waste of resources (e.g., storage, computation, and bandwidth) in ESs. Therefore, it is a challenge to provide high-quality services while guaranteeing the resource efficiency with edge content caching. To address the challenge, an edge content caching method for smart cities with service requirement prediction, named E-Cache, is proposed. First, the future service requirements from the vehicles are predicted based on the deep spatiotemporal residual network (ST-ResNet). Then, preliminary content caching schemes are elaborated based on the predicted service requirements, which are further adjusted by a many-objective optimization aiming at minimizing the execution time and the energy consumption of the vehicular services. Eventually, experimental evaluations prove the efficiency and effectiveness of E-Cache with spatiotemporal traffic trajectory big data.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "525", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3604942", "title": "Improving Quality of Service for Users of Leaderless DAG-Based Distributed Ledgers", "doi": "10.1145/3624969", "issn": "2769-6472", "journal_name": "Distributed Ledger Technologies: Research and Practice", "date_publication": "September 2023", "abstract": "Usability of distributed ledgers is crucial to their mainstream adoption, especially for enterprise applications in which most users do not wish to operate full-node infrastructure. Some attempts have been made to solve the problem of user-node interaction for blockchains in which leaders assemble users’ transactions into blocks, but in the case of leaderless DAG-based ledgers such as IOTA, many of these solutions cannot be applied due to the absence of a shared mempool and the ability of nodes to issue blocks in parallel. In this work, we propose a user-node interaction mechanism for ledgers of this kind that is designed to balance user traffic across nodes and ensure the risk of a user experiencing a poor quality of service is low. Our mechanism involves users selecting nodes to issue their transactions to the ledger based on quality of service indicators advertised by the nodes. Simulation results are presented to illustrate the efficacy of the proposed policies.", "authors": [{"Name": "Andrew Cullen", "Information": "Imperial College London, United Kingdom"}, {"Name": "Lianna Zhao", "Information": "Imperial College London, United Kingdom"}, {"Name": "Luigi Vigneri", "Information": "IOTA Foundation, Germany"}, {"Name": "Robert N Shorten", "Information": "Imperial College London, United Kingdom"}], "publisher": "Association for Computing Machinery", "total_usage": "269", "year": "2023"}, {"article_link": "https://dl.acm.org/doi/10.1145/3507910", "title": "Governance of Autonomous Agents on the Web: Challenges and Opportunities", "doi": "10.1145/3561988", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "November 2022", "abstract": "The study of autonomous agents has a long history in the Multiagent System and the Semantic Web communities, with applications ranging from automating business processes to personal assistants. More recently, the Web of Things (WoT), which is an extension of the Internet of Things (IoT) with metadata expressed in Web standards, and its community provide further motivation for pushing the autonomous agents research agenda forward. Although representing and reasoning about norms, policies, and preferences is crucial to ensuring that autonomous agents act in a manner that satisfies stakeholder requirements, normative concepts, policies, and preferences have yet to be considered as first-class abstractions in Web-based multiagent systems. Towards this end, this article motivates the need for alignment and joint research across the Multiagent Systems, Semantic Web, and WoT communities, introduces a conceptual framework for governance of autonomous agents on the Web, and identifies several research challenges and opportunities.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "926", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3488245", "title": "Why Do Smart Contracts Self-Destruct? Investigating the Selfdestruct Function on Ethereum", "doi": "10.1145/3492439", "issn": "1049-331X", "journal_name": "ACM Transactions on Software Engineering and Methodology", "date_publication": "April 2022", "abstract": "The selfdestruct function is provided by Ethereum smart contracts to destroy a contract on the blockchain system. However, it is a double-edged sword for developers. On the one hand, using the selfdestruct function enables developers to remove smart contracts (SCs) from Ethereum and transfers Ethers when emergency situations happen, e.g., being attacked. On the other hand, this function can increase the complexity for the development and open an attack vector for attackers. To better understand the reasons why SC developers include or exclude the selfdestruct function in their contracts, we conducted an online survey to collect feedback from them and summarize the key reasons. Their feedback shows that 66.67% of the developers will deploy an updated contract to the Ethereum after destructing the old contract. According to this information, we propose a method to find the self-destructed contracts (also called predecessor contracts) and their updated version (successor contracts) by computing the code similarity. By analyzing the difference between the predecessor contracts and their successor contracts, we found five reasons that led to the death of the contracts; two of them (i.e., Unmatched ERC20 Token and Limits of Permission) might affect the life span of contracts. We developed a tool named LifeScope to detect these problems. LifeScope reports 0 false positives or negatives in detecting Unmatched ERC20 Token. In terms of Limits of Permission, LifeScope achieves 77.89% of F-measure and 0.8673 of AUC in average. According to the feedback of developers who exclude selfdestruct functions, we propose suggestions to help developers use selfdestruct functions in Ethereum smart contracts better.", "authors": [{"Name": "Jiachi Chen", "Information": "Monash University"}, {"Name": "Xin Xia", "Information": "Monash University"}, {"Name": "David Lo", "Information": "Singapore Management University"}, {"Name": "John C. Grundy", "Information": "Monash University"}], "publisher": "Association for Computing Machinery", "total_usage": "891", "year": "2022"}, {"article_link": "https://dl.acm.org/doi/10.1145/3467956", "title": "StarFL: Hybrid Federated Learning Architecture for Smart Urban Computing", "doi": "10.1145/3468075", "issn": "2157-6904", "journal_name": "ACM Transactions on Intelligent Systems and Technology", "date_publication": "August 2021", "abstract": "From facial recognition to autonomous driving, Artificial Intelligence (AI) will transform the way we live and work over the next couple of decades. Existing AI approaches for urban computing suffer from various challenges, including dealing with synchronization and processing of vast amount of data generated from the edge devices, as well as the privacy and security of individual users, including their bio-metrics, locations, and itineraries. Traditional centralized-based approaches require data in each organization be uploaded to the central database, which may be prohibited by data protection acts, such as GDPR and CCPA. To decouple model training from the need to store the data in the cloud, a new training paradigm called Federated Learning (FL) is proposed. FL enables multiple devices to collaboratively learn a shared model while keeping the training data on devices locally, which can significantly mitigate privacy leakage risk. However, under urban computing scenarios, data are often communication-heavy, high-frequent, and asynchronized, posing new challenges to FL implementation. To handle these challenges, we propose a new hybrid federated learning architecture called StarFL. By combining with Trusted Execution Environment (TEE), Secure Multi-Party Computation (MPC), and (Beidou) satellites, StarFL enables safe key distribution, encryption, and decryption, and provides a verification mechanism for each participant to ensure the security of the local data. In addition, StarFL can provide accurate timestamp matching to facilitate synchronization of multiple clients. All these improvements make StarFL more applicable to the security-sensitive scenarios for the next generation of urban computing.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "1,097", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3414475", "title": "Efficient Distributed Decryption Scheme for IoT Gateway-based Applications", "doi": "10.1145/3441681", "issn": "1533-5399", "journal_name": "ACM Transactions on Internet Technology", "date_publication": "February 2021", "abstract": "With the evolvement of the Internet of things (IoT), privacy and security have become the primary indicators for users to deploy IoT applications. In the gateway-based IoT architecture, gateways aggregate data collected by perception-layer devices and upload message packets to platforms, while platforms automatically push different categories of data to different applications. However, security in processes of data transmission via gateways, storage in platforms, access by applications is the major challenge for user privacy protection. To tackle this challenge, this article presents a secure IoT scheme based on a fine-grained multi-receive signcryption scheme to realize end-to-end secure transmission and data access control. To enhance the security of online application decryption keys, we design a distributed threshold decryption scheme based on secret-sharing. Moreover, from the provable security perspective, we demonstrate that the scheme can achieve the expected IND-CCA security and EUF-CMA security. After the performance analysis, evaluation results show that the computational performance is efficient and linearly subject to the number of messages and the number of receivers.", "authors": [{"Name": "Cong Peng", "Information": "School of Mathematics and Statistics, Wuhan University, Wuhan, China"}, {"Name": "Jianhua Chen", "Information": "School of Mathematics and Statistics, Wuhan University, Wuhan, China"}, {"Name": "Pandi Vijayakumar", "Information": "Department of Computer Science and Engineering, University College of Engineering Tindivanam, Tindivanam, India"}, {"Name": "Neeraj Kumar", "Information": "Department of Computer Science and Engineering, Thapar University, Patiala, India"}, {"Name": "Debiao He", "Information": "School of Cyber Science and Engineering, Wuhan University, Wuhan, China"}], "publisher": "Association for Computing Machinery", "total_usage": "316", "year": "2021"}, {"article_link": "https://dl.acm.org/doi/10.1145/3587933", "title": "Privacy-preserving Resilient Consensus for Multi-agent Systems in a General Topology Structure", "doi": "10.1145/3582895", "issn": "2471-2566", "journal_name": "ACM Transactions on Privacy and Security", "date_publication": "August 2023", "abstract": "Recent advances of consensus control have made it significant in multi-agent systems such as in distributed machine learning, distributed multi-vehicle cooperative systems. However, during its application it is crucial to achieve resilience and privacy; specifically, when there are adversary/faulty nodes in a general topology structure, normal agents can also reach consensus while keeping their actual states unobserved.", "authors": [], "publisher": "Association for Computing Machinery", "total_usage": "218", "year": "2023"}]